In [19]:
# Received an error about the package, google said try this, VSCode says its there already, i thought it was so maybe i started off in the wrong space.
#pip install SQLAlchemy Flask-SQLAlchemy

In [49]:
#imported this but don't know what else I need
from sqlalchemy import create_engine
import pandas as pd
import geopandas as gpd
import matplotlib as plt
from shapely.geometry import point
import folium
from folium.plugins import MarkerCluster
from folium.plugins import FastMarkerCluster

In [21]:
#Connection string, so python can access sql table/data
database_name = 'scooters'    # Fill this in with your scooter database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [22]:
#create a variable for sql data
engine = create_engine(connection_string, query_cache_size=1200)

In [23]:
#1eda: Are there any null values?
#check first table SCOOTERS for missing values, appears CHARGELEVEL is the only column with null values
#yes - chargelevel has 770 difference from all the other columns listed

query1_eda = '''
SELECT COUNT(pubdatetime) AS pubdatetime, COUNT(latitude) AS lat, COUNT(longitude) AS lon, COUNT(sumdid) AS sumdid, COUNT(sumdtype) AS sumdtype, COUNT(chargelevel) AS chargelevel, 
COUNT(sumdgroup) AS sumdgroup, COUNT(costpermin) AS costpermin, COUNT(companyname) AS company
FROM scooters;
'''

pd.read_sql(query1_eda, con = engine)

,pubdatetime,lat,lon,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,company
0,73414043,73414043,73414043,73414043,73414043,73413273,73414043,73414043,73414043

In [24]:
#check second table TRIPS to see if there are any missing values, and there are not. 
query1a_eda= '''
SELECT COUNT(pubtimestamp) AS pubtimestamp, COUNT(companyname) AS companyname, COUNT(triprecordnum) AS tripnum, COUNT(sumdid) AS sumdid, COUNT(tripduration) AS tripduration, 
COUNT(tripdistance) AS tripdistance, COUNT(startdate) AS startdate, COUNT(starttime) AS starttime, COUNT(enddate) AS enddate, COUNT(endtime) AS endtime, COUNT(startlatitude) AS startlat,
COUNT(startlongitude) AS startlong, COUNT(endlatitude) AS endlat, COUNT(endlongitude) AS endlong, COUNT(triproute) AS triproute, COUNT(create_dt) AS create_dt
FROM trips;
'''
pd.read_sql(query1a_eda, con=engine)

,pubtimestamp,companyname,tripnum,sumdid,tripduration,tripdistance,startdate,starttime,enddate,endtime,startlat,startlong,endlat,endlong,triproute,create_dt
0,565522,565522,565522,565522,565522,565522,565522,565522,565522,565522,565522,565522,565522,565522,565522,565522

In [7]:
#2eda :What is the Date range represented in each of the date columns - investigate any that seem odd.
#scooters table
query2_eda = '''
SELECT MIN(pubdatetime) AS mindate, MAX(pubdatetime) AS maxdate
FROM scooters;
'''
pd.read_sql(query2_eda, con = engine)

#earliest date 05/01/2019
#latest date 07/31/2019

                  mindate             maxdate
0 2019-05-01 00:01:41.247 2019-07-31 23:59:57

In [8]:
#check second table for earliest and latest dates
#trips table

query2a_eda = '''
SELECT 
MIN(pubtimestamp) AS min_ptstamp,MAX(pubtimestamp) AS max_ptstamp, 
MIN(startdate) AS min_startdate, MAX(startdate) AS max_startdate, 
MIN(enddate) AS min_enddate, MAX(enddate) AS max_enddate
FROM trips;
'''

pd.read_sql(query2a_eda, con = engine)
# earliest date I see is 05/01/2019 and absolute latest date i see is 08/01/2019

,min_ptstamp,max_ptstamp,min_startdate,max_startdate,min_enddate,max_enddate
0,2019-05-01 00:00:55.423,2019-08-01 07:04:00,2019-05-01,2019-07-31,2019-05-01,2019-08-01

In [9]:
#3eda: Is time represented with am/pm or using 24 hour values in each of the columns that include time?
#looking above at results, time is represented in 24 hour values for the pubdatetime column in scooters and trip table

In [10]:
#4eda: What values are there in the sumdgroup column? Are there any that are not of interest for this project?
query4a_eda = '''
SELECT DISTINCT(sumdgroup)
FROM scooters
LIMIT 20;
'''
pd.read_sql(query4a_eda, con = engine)
#print(query4a_eda)
#print(type(query4a_eda))

#values are string - results are Scooter, scooter, and bicylce (which is not of interest).

  sumdgroup
0   bicycle
1   scooter
2   Scooter

In [11]:
#5eda: What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?
#without plotting to see a visual, i think its odd that for the this first query I got 0.00
query5a_eda = '''
SELECT MIN(latitude), MAX(longitude)
FROM scooters;
'''
pd.read_sql(query5a_eda, con = engine)

   min  max
0  0.0  0.0

In [12]:
query5b_eda = '''
SELECT 
MIN(startlatitude) AS min_startlat, MAX(startlatitude) AS max_startlat,
MIN(endlatitude) AS min_endlat, MAX(endlatitude) AS max_endlat,
MIN(startlongitude) AS min_startlon, MAX(startlongitude) AS max_startlon,
MIN(endlongitude) AS min_endlon, MAX(endlongitude) AS max_endlon
FROM trips;
'''
pd.read_sql(query5b_eda, con = engine)

,min_startlat,max_startlat,min_endlat,max_endlat,min_startlon,max_startlon,min_endlon,max_endlon
0,35.8532,36.300029,-36.850405,51.045409,-86.918008,-86.3662,-122.673729,174.764886

In [13]:
#6eda : What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.

query6a_eda = '''
SELECT companyname, COUNT(DISTINCT triprecordnum) AS tr_num_bygrp
FROM trips
GROUP BY companyname;
'''
pd.read_sql(query6a_eda, con = engine)

     companyname  tr_num_bygrp
0           Bird         10868
1  Bolt Mobility          1232
2         Gotcha           187
3           JUMP           850
4           Lime         50656
5           Lyft          3582
6           SPIN          1597

In [14]:
#7eda : Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?
# The naming convention is slightly different for the companynames from the trips table. Tried union and it does not reflect this. 
query7a_eda = '''
SELECT DISTINCT(companyname)
FROM scooters;
'''
pd.read_sql(query7a_eda, con = engine)

  companyname
0        Bird
1        Bolt
2      Gotcha
3        Jump
4        Lime
5        Lyft
6        Spin

In [15]:
query7b_eda = '''
SELECT DISTINCT(companyname)
FROM trips;
'''
pd.read_sql(query7b_eda, con = engine)

     companyname
0           Bird
1  Bolt Mobility
2         Gotcha
3           JUMP
4           Lime
5           Lyft
6           SPIN

#1. During this period, seven companies offered scooters.

In [37]:
 #A :How many scooters did each company have in this time frame? 

query1A = '''
SELECT companyname, COUNT(DISTINCT sumdid) 
FROM scooters
GROUP BY companyname
ORDER BY companyname;
'''
pd.read_sql(query1A, con = engine)

  companyname  count
0        Bird   3860
1        Bolt    360
2      Gotcha    224
3        Jump   1210
4        Lime   1824
5        Lyft   1735
6        Spin    805

In [26]:
#B :Did the number for each company change over time? 
query1B = '''
SELECT companyname, COUNT(DISTINCT sumdid), DATE_TRUNC('month', pubdatetime) AS date
FROM scooters
GROUP BY companyname, date
ORDER BY companyname, date;
'''
pd.read_sql(query1B, con = engine)

# Yes, number of scooters varied per month

   companyname  count       date
0         Bird   3064 2019-05-01
1         Bird   2910 2019-06-01
2         Bird   2583 2019-07-01
3         Bolt    346 2019-05-01
4         Bolt    333 2019-06-01
5         Bolt    276 2019-07-01
6       Gotcha    223 2019-05-01
7       Gotcha    223 2019-06-01
8       Gotcha    224 2019-07-01
9         Jump    976 2019-05-01
10        Jump   1036 2019-06-01
11        Jump   1206 2019-07-01
12        Lime   1632 2019-05-01
13        Lime   1461 2019-06-01
14        Lime    903 2019-07-01
15        Lyft   1376 2019-05-01
16        Lyft   1152 2019-06-01
17        Lyft   1026 2019-07-01
18        Spin    687 2019-05-01
19        Spin    713 2019-06-01
20        Spin    570 2019-07-01

In [ ]:
#C :Did scooter usage vary by company?
#this query is pulling the company name and the sum of all tripduration (in minutes)/ grouped by the companyname
query1C = '''
SELECT companyname, ROUND(SUM(tripduration),2) AS sum_tripduration_perco
FROM trips
GROUP BY companyname;
'''
pd.read_sql(query1C, con = engine)

###REVISIT ME

     companyname  sum_tripduration_perco
0           Bird              2046202.00
1  Bolt Mobility             30821497.00
2         Gotcha                33802.78
3           JUMP               211001.30
4           Lime              3507335.40
5           Lyft              1936369.53
6           SPIN               900575.00

2. According to Second Substitute Bill BL2018-1202 (as amended) (https://web.archive.org/web/20181019234657/https://www.nashville.gov/Metro-Clerk/Legislative/Ordinances/Details/7d2cf076-b12c-4645-a118-b530577c5ee8/2015-2019/BL2018-1202.aspx), all permitted operators will first clean data before providing or reporting data to Metro. Data processing and cleaning shall include:

In [38]:
#1 Removal of staff servicing and test trips 
#2 Removal of trips below one minute  
#3 Trip lengths are capped at 24 hours 

query2 = '''
SELECT companyname, COUNT(tripduration)
FROM trips
WHERE tripduration < 1 AND tripduration < 1440 
  AND companyname IN (SELECT companyname FROM scooters WHERE costpermin = 0.00)
GROUP BY companyname;;
'''
pd.read_sql(query1, con = engine)


remove_junk = query2

  companyname  count
0        Bird   3963
1        Lime    661
2        Lyft   4530

3. The goal of Metro Nashville is to have each scooter used a minimum of 3 times per day. Based on the data, what is the average number of trips per scooter per day? Make sure to consider the days that a scooter was available. How does this vary by company?

In [39]:
query3 = '''
SELECT companyname, startdate, COUNT(DISTINCT triprecordnum) / COUNT(DISTINCT DATE(startdate)) AS avg_trips_per_day
FROM trips
GROUP BY companyname, startdate
HAVING COUNT(DISTINCT triprecordnum) / COUNT(DISTINCT DATE(startdate)) > 3;
'''

pd.read_sql(query3, con = engine)

    companyname   startdate  avg_trips_per_day
0          Bird  2019-05-01               1107
1          Bird  2019-05-02               1249
2          Bird  2019-05-03               2007
3          Bird  2019-05-04               2734
4          Bird  2019-05-05               2010
..          ...         ...                ...
519        SPIN  2019-07-27                608
520        SPIN  2019-07-28                423
521        SPIN  2019-07-29                292
522        SPIN  2019-07-30                227
523        SPIN  2019-07-31                188

[524 rows x 3 columns]

##4 Project -- SUMDs can provide alternative transportation and provide "last mile" access to public transit. ##How often are trips starting near public transit hubs?

In [29]:
##recycle zipcode and busgeo data from geospatial workshop....moved copy into scooters data folder

##4 Project Prep
##read in zipcode data / verify crs / review head

zipcodes = gpd.read_file('../data/zipcodes.geojson')
print(zipcodes.crs)
zipcodes.head()

EPSG:4326

,zip,objectid,po_name,shape_stlength,shape_starea,geometry
0,37115,1,MADISON,178783.02488886821,596553400.57885742,"MULTIPOLYGON (((-86.68725 36.31821, -86.68722 ..."
1,37216,3,NASHVILLE,75820.997821400058,188884682.28344727,"MULTIPOLYGON (((-86.73451 36.23774, -86.73425 ..."
2,37204,9,NASHVILLE,93180.292250425613,200664795.51708984,"MULTIPOLYGON (((-86.77914 36.13424, -86.77923 ..."
3,37027,11,BRENTWOOD,159760.6942933173,174978422.04101562,"MULTIPOLYGON (((-86.81258 36.06319, -86.81263 ..."
4,37064,18,FRANKLIN,28995.828320601937,46969608.005737305,"MULTIPOLYGON (((-87.02197 36.01200, -87.02140 ..."

In [30]:
##4 Project Prep
##verify df type / clean out excess columns
zipcodes = zipcodes[['zip', 'po_name', 'geometry']]
zipcodes.head()

     zip    po_name                                           geometry
0  37115    MADISON  MULTIPOLYGON (((-86.68725 36.31821, -86.68722 ...
1  37216  NASHVILLE  MULTIPOLYGON (((-86.73451 36.23774, -86.73425 ...
2  37204  NASHVILLE  MULTIPOLYGON (((-86.77914 36.13424, -86.77923 ...
3  37027  BRENTWOOD  MULTIPOLYGON (((-86.81258 36.06319, -86.81263 ...
4  37064   FRANKLIN  MULTIPOLYGON (((-87.02197 36.01200, -87.02140 ...

In [31]:
##4 Project Prep
##read in bus stop data / review shape, info, & head

bus_stops= pd.read_csv('../data/busstops_cleaned.csv')
print(bus_stops.shape)
bus_stops.info()
bus_stops.head()

(2524, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2524 entries, 0 to 2523
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   stop      2524 non-null   object
 1   route     2524 non-null   object
 2   location  2524 non-null   object
 3   lat       2524 non-null   float64
 4   lng       2524 non-null   float64
dtypes: float64(2), object(3)
memory usage: 98.7+ KB

,stop,route,location,lat,lng
0,GREEN LN & WHITES CREEK PIKE WB,GOLDEN VALLEY,"(36.236249, -86.816722)",36.236249,-86.816722
1,_ 9TH AVE S & EDGEHILL AVE SB,8TH AVENUE SOUTH,"(36.142642, -86.780897)",36.142642,-86.780897
2,DONELSON/DELL STATION OUTBOUND,MURFREESBORO PIKE,"(36.105615, -86.672004)",36.105615,-86.672004
3,17TH AVE S & DOROTHY PL SB,BELMONT,"(36.137623, -86.795609)",36.137623,-86.795609
4,COCKRILL ST & 14TH AVE N,ST. CECILIA - CUMBERLAND,"(36.175944, -86.804242)",36.175944,-86.804242

In [32]:
##4 Project Prep
##add geometry / create GeoDataFrame / verify type
##notes from geospatial workshop state that we must adjust bus_stops df to create GeoDataFrame():
##GeoDataFrame requires: df, crs, geometry
##add geometry: add 'geometry' column make it a point data type / use lambda function to execute on all rows in df
##add coordinate reference system (crs): use zipcodes crs to ensure matching crs

bus_stops['geometry'] = bus_stops.apply(lambda x: Point((x.lng, x.lat)), axis=1)
bus_geo = gpd.GeoDataFrame(bus_stops, crs=zipcodes.crs, geometry=bus_stops['geometry'])
type(bus_geo)

NameError: name 'Point' is not defined

In [33]:
##4 Project Prep
##retrieve startlatitude / startlongitude from trips table in SQL

scooter_start_loc=  '''
SELECT startlongitude AS lng, startlatitude AS lat
FROM trips;
'''
scooter_start_loc = pd.read_sql(scooter_start_loc, con = engine)
scooter_start_loc.insert(0, 'scooter_st_loc', 'scooter_start', True)
scooter_start_loc.head()

  scooter_st_loc       lng       lat
0  scooter_start -86.80360  36.15710
1  scooter_start -86.77896  36.15797
2  scooter_start -86.78180  36.15470
3  scooter_start -86.77950  36.14940
4  scooter_start -86.78660  36.17780

In [34]:
##4 Project Prep
##notes from geospatial workshop state that we must adjust bus_stops df to create GeoDataFrame():
##GeoDataFrame requires: df, crs, geometry
##add geometry: add 'geometry' column make it a point data type / use lambda function to execute on all rows in df
##add coordinate reference system (crs): use zipcodes crs to ensure matching crs
scooter_start_loc['geometry'] = scooter_start_loc.apply(lambda x: Point((x.lng, x.lat)), axis=1)
scooter_start_geo = gpd.GeoDataFrame(scooter_start_loc, crs=zipcodes.crs, geometry=scooter_start_loc['geometry'])
type(scooter_start_geo)

NameError: name 'Point' is not defined

In [36]:
##4 Project Prep 
##Reviewing GeoPandas info for spatial join (gpd.sjoin) and found spatial join nearest (gpd_sjoin_nearest)...one of the features in sjoin_nearest is an argument when joining that allows you to set an argument 'max distance'. Max distance can be set to join info that is within the max distance from items on the right table. sjoin_nearest can work with degrees or distance (in meters). If the crs uses lat/lon degrees must be used. The process for using degrees seemed overly complicated and I found a way to change the crs using to_crs() to an epsg that works in meters (epsg = 3857). See links below for more details. 
# ** May Use this if I do a spatial join nearest.....required to adjust max distance in meters **
##https://github.com/geopandas/geopandas/discussions/2797
##https://geopandas.org/en/stable/docs/reference/api/geopandas.GeoDataFrame.sjoin_nearest.html#geopandas.GeoDataFrame.sjoin_nearest
##https://geopandas.org/en/stable/docs/reference/api/geopandas.GeoDataFrame.to_crs.html

##4 Project Prep
##update crs for use w/ 
zipcodes_3857 = zipcodes.to_crs("epsg:3857")
scooter_start_3857 = scooter_start_geo.to_crs("epsg:3857")

NameError: name 'scooter_start_geo' is not defined

In [ ]:
##4 Project Prep 
##verify crs update
print(zipcodes_3857.crs)
print(scooter_start_3857.crs)

In [ ]:
##4 Project Prep 
##update / verify crs
bus_geo_3857 = bus_geo.to_crs("epsg:3857")
print(bus_geo_3857.crs)

In [ ]:
##4 Project Prep 
## review after sjoin
busgeo3857_w_scooterst3857.head()

In [ ]:
##4 Project Prep 
##Trimming the zips table down to just the geometry / polygon info
polygon_zips_3857 = zipcodes['geometry']
polygon_zips_3857.shape
polygon_zips_3857

In [ ]:
##4 Project Prep
##From geospatial workshop: folium maps require a center point for the street map
polygon_zips_3857.geometry.centroid

In [ ]:
##4 Project Prep
##Used Google to find lat/lon center of Nashville (36.1627Â° N, 86.7816Â° W)...found a point in the list that was close
center = polygon_zips_3857.geometry.centroid[31]
print(center)

In [ ]:
##4 Project Answer
##build map with clusters & markers for bus stops and scooter start points

cluster_map_nashville_scooter_rvw = folium.Map(location = area_center, zoom_start = 10)

marker_cluster = MarkerCluster().add_to(cluster_map_nashville_scooter_rvw)

folium.GeoJson(polygon_zips_3857).add_to(cluster_map_nashville_scooter_rvw)

for row_index, row_values in busgeo3857_w_scooterst3857.iterrows():
    loc = [row_values['lat_left'], row_values['lng_left']]
    pop = str(row_values['route'])
    icon = folium.Icon(color='blue', icon='bus', prefix='fa')
    
    marker = folium.Marker(location = loc, popup = pop, icon = icon)
    
    marker.add_to(marker_cluster)
    
for row_index, row_values in busgeo3857_w_scooterst3857.iterrows():
    loc = [row_values['lat_right'], row_values['lng_right']]
    pop = str(row_values['scooter_st_loc'])
    icon = folium.Icon(color='red', icon='star', prefix='fa')
    
    marker = folium.Marker(location = loc, popup = pop, icon = icon)
    
    marker.add_to(marker_cluster)
cluster_map_nashville_scooter_rvw.save('../maps/cluster_map_nashville_scooter_rvw.html')

cluster_map_nashville_scooter_rvw

In [ ]:
##4 Project Answer: 
## review value count of scooter start locations within 100 meters of a bus stop. value count = 1603
busgeo3857_w_scooterst3857['scooter_st_loc'].value_counts()

In [45]:
#Deliverables to focus on -- tripduration (TIMES)
#below is the average trip duration in minutes... bolt only had 360 scooters..

query3a = '''
SELECT companyname, AVG(tripduration) AS avg_duration_minutes
FROM trips
GROUP BY companyname;
'''
pd.read_sql(query3a, con = engine)

     companyname  avg_duration_minutes
0           Bird             13.396196
1  Bolt Mobility           1408.017222
2         Gotcha             10.196918
3           JUMP             32.779447
4           Lime             15.540224
5           Lyft             16.004244
6           SPIN             26.141509

In [46]:
#Deliverables to focus on  -- TIMES 

query3b = '''
SELECT MIN(starttime) AS minimum,
PERCENTILE_CONT(0.25) WITHIN GROUP (ORDER BY starttime) AS q1,
PERCENTILE_CONT(0.5)WITHIN GROUP (ORDER BY starttime) AS q2,
PERCENTILE_CONT(0.75)WITHIN GROUP (ORDER BY starttime) AS q3,
MAX(starttime) AS maximum
FROM trips;
'''

pd.read_sql(query3b, con = engine)

    minimum              q1              q2              q3          maximum
0  00:00:00 0 days 05:15:37 0 days 17:22:24 0 days 20:35:16  23:59:59.506666

In [51]:
#Deliverables to focus on -- TIMES -- as in, the times the scooters were most used?

query3c = '''
SELECT EXTRACT('hour' FROM pubtimestamp) AS hour
FROM trips;
'''
pd.read_sql(query3c, con = engine)
print(query3c.describe())

AttributeError: 'str' object has no attribute 'describe'